In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
    'name': ['Robert', 'Felicia', 'Diana'],
    'age': [22, 34, 27],
    'occupation': ['Designer', 'Programmer', 'Data Scientist']
})

In [3]:
df.iat[2,1] = float('nan')

In [4]:
df

      name   age      occupation
0   Robert  22.0        Designer
1  Felicia  34.0      Programmer
2    Diana   NaN  Data Scientist

In [5]:
df.dropna() # if you have invalid values in your data frame, 
            # you can use this to delete all the rows that contain nan values

      name   age  occupation
0   Robert  22.0    Designer
1  Felicia  34.0  Programmer

In [6]:
df.loc[2] = ['Jim', 26, 'Manager']

In [7]:
df.loc[3] = ['Diana', 29, 'Senior Delevoper']

In [8]:
df

      name   age        occupation
0   Robert  22.0          Designer
1  Felicia  34.0        Programmer
2      Jim  26.0           Manager
3    Diana  29.0  Senior Delevoper

In [9]:
df.iat[2,1] = float('nan')

In [10]:
df

      name   age        occupation
0   Robert  22.0          Designer
1  Felicia  34.0        Programmer
2      Jim   NaN           Manager
3    Diana  29.0  Senior Delevoper

In [17]:
df = df.fillna(25) # you can also fill the nan values using this function

In [18]:
df.iat[0, 2] = None

In [19]:
df.iat[1, 2] = None

In [20]:
df

      name   age        occupation
0   Robert  22.0              None
1  Felicia  34.0              None
2      Jim  25.0           Manager
3    Diana  29.0  Senior Delevoper

In [ ]:
df.notna() # this will evaluate with boolean values if the data frame contains a nan value
            # the false ones are the nan values

   name   age  occupation
0  True  True       False
1  True  True       False
2  True  True        True
3  True  True        True